package array;

public class Array {
    /**
     * 1、Java数组介绍
     *      在Java中，数组是用来存放同一种数据类型的集合，注意只能存放同一种数据类型(Object类型数组除外)。
     *      　①、数组的声明
     *
     * 　　第一种方式：
     *          数据类型 []  数组名称 = new 数据类型[数组长度];
     * 　　这里 [] 可以放在数组名称的前面，也可以放在数组名称的后面，我们推荐放在数组名称的前面，这样看上去 数据类型 [] 表示的很明显是一个数组类型，而放在数组名称后面，则不是那么直观。
     *
     * 　　第二种方式：
     *
     *      数据类型 [] 数组名称 = {数组元素1，数组元素2，......}
     * 　　这种方式声明数组的同时直接给定了数组的元素，数组的大小由给定的数组元素个数决定。

     * //声明数组1,声明一个长度为3，只能存放int类型的数据
     * int [] myArray = new int[3];
     * //声明数组2,声明一个数组元素为 1,2,3的int类型数组
     * int [] myArray2 = {1,2,3};
     */

}
